'''
Description: 
Author: zgong
Date: 2020-05-17 16:05:14
LastEditTime: 2020-12-17 23:17:01
LastEditors: zgong
FilePath: /ArkZeus/utils/config/TimeTable.py
Reference: 
'''
TIME_TABLE = {
    '4-9': 160,  #海胆
    '3-2': 120,  #轻锰矿
    '7-17': 130,  #研磨石
    '1-7': 90,  #固源岩
    'JT8-3':240,  #酮组
    'S4-1': 120,  #铁组
    '7-15': 120, #装置
    'R8-2': 'wait',  # 扭转醇
    '7-4': 120, #酯组
    '4-2': 110,  #糖组
    'JT8-2': 120, #凝胶
    'S3-6' : 100, #炽合金
    'R8-11':  180, #晶体元件
    #---------------------------#
    'S5-7': 120, #凝胶
    
    '3-1': 120,  #酮组
    '4-5':120, #酮组
    '3-2': 120,  #轻锰矿
    '4-7': 120,  #轻锰矿
    '4-4': 160,  # 扭转醇
    '7-18':180, #铁组
    'S5-8': 120,#炽合金
    '2-10': 130,  #海胆
    '3-3': 130,  # 研磨石
    '3-4': 180,  
    '3-8': 130,  #酯组
    '4-6': 140,  #糖
    'S4-10': 100,
    '5-10': 210,
    '6-2': 140, #锰矿
    '6-16': 210,
    # 芯片
    'PR-A-1': 140,#医疗/重装
    'PR-A-2': 180,
    'PR-B-1': 120,#术士/狙击
    'PR-B-2': 180,
    'PR-C-1': 120,#先锋/辅助
    'PR-C-2': 180,
    'PR-D-1': 120,#近卫/特种
    'PR-D-2': 180,
    # 物资
    'CE-5': 150,
    'LS-5': 180,
    'LS-4': 100,
    'LS-3': 120,
    'CE-3': 120,
    'AP-5': 150,
    'CE-4': 120,
    'SK-5': 120,
    # 剿灭
    'waihuan': 900,
    'shiqu': 1100,
    'qishi':900,
    # 午间逸话
    'SA-5':150, # 扭转醇
    'SA-6' : 190,#炽合金
    # 火蓝之心
    'OF-6': 150,
    'OF-7': 180,  #40黑耀石
    'OF-8': 220,  #10 门票
    'OF-3': 200,
    'OF-F3': 200,
    'OF-F4': 140,
    # 生于黑夜
    'DM-8': 120,#异铁
    'DM-6': 110,#糖
    # 乌萨斯的孩子
    'SV-7':150,#凝胶
    #沃伦姆德的薄暮
    'TW-8':160,#研磨石
    'TW-7':125,#酮凝集
    #大酋长之路
    'RI-7':140, #糖
    'RI-8':160, #八角
    #骑兵与猎人
    'GT-5':130, #扭转醇
    #卡西米尔
    'MN-8':140, #轻锰矿
    #孤岛风云
    'MB-7':120, #酮凝集
    'BH-8': 140,  #海胆

}
